{
    "title": "Vietnam Buddhist Center History 2",
    "slideshowTitle": "Our Journey",
    "slides": "/about_slideshow/IMG_0034.HEIC\n/about_slideshow/IMG_0140.HEIC\n/about_slideshow/IMG_0156.HEIC\n/about_slideshow/IMG_0195.HEIC\n/about_slideshow/IMG_0393.JPEG\n/about_slideshow/IMG_0411.JPEG\n/about_slideshow/IMG_0453.JPEG\n/about_slideshow/IMG_1828.JPG\n/about_slideshow/IMG_1835.JPG\n/about_slideshow/IMG_1839.JPG\n/about_slideshow/IMG_1843.JPG\n/about_slideshow/IMG_1849.JPG\n/about_slideshow/IMG_1888.JPG\n/about_slideshow/IMG_1892.JPG\n/about_slideshow/IMG_1906.JPG\n/about_slideshow/IMG_1909.JPG\n/about_slideshow/IMG_1914.JPG\n/about_slideshow/IMG_1924.JPG\n/about_slideshow/IMG_1933.JPG\n/about_slideshow/IMG_1940.JPG\n/about_slideshow/IMG_1943.JPG\n/about_slideshow/IMG_1981.JPG\n/about_slideshow/IMG_1993.JPG\n/about_slideshow/IMG_1995.JPG\n/about_slideshow/IMG_1996.JPG\n/about_slideshow/IMG_2099.JPG\n/about_slideshow/IMG_2103.JPG\n/about_slideshow/IMG_2198.JPG\n/about_slideshow/IMG_2203.JPG\n/about_slideshow/IMG_2213.JPG\n/about_slideshow/IMG_2226.HEIC\n/about_slideshow/IMG_2227.HEIC\n/about_slideshow/IMG_2731.JPG\n/about_slideshow/IMG_2732.JPG\n/about_slideshow/IMG_3487.HEIC\n/about_slideshow/IMG_5406.JPEG\n/about_slideshow/IMG_5474.JPEG\n/about_slideshow/IMG_5495.JPEG\n/about_slideshow/IMG_5540.JPEG\n/about_slideshow/IMG_5711.JPEG\n/about_slideshow/IMG_5770.JPEG\n/about_slideshow/IMG_5776.JPEG\n/about_slideshow/IMG_5782.JPG\n/about_slideshow/IMG_5825.JPEG\n/about_slideshow/IMG_5835.JPEG\n/about_slideshow/IMG_5970.JPEG\n/about_slideshow/IMG_5977.JPEG\n/about_slideshow/IMG_5979.JPEG\n/about_slideshow/IMG_5991.JPEG\n/about_slideshow/IMG_6433.JPEG\n/about_slideshow/IMG_6507.JPEG\n/about_slideshow/IMG_7055.JPG\n/about_slideshow/IMG_7056.JPG\n/about_slideshow/IMG_7057.JPG\n/about_slideshow/IMG_7058.JPG\n/about_slideshow/IMG_7059.JPG\n/about_slideshow/IMG_7060.JPG\n/about_slideshow/IMG_7061.JPG\n/about_slideshow/IMG_7062.JPG\n/about_slideshow/IMG_7063.JPG\n/about_slideshow/IMG_7236.JPG\n/about_slideshow/IMG_7243.JPG\n/about_slideshow/IMG_7246.JPG\n/about_slideshow/IMG_7248.JPG\n/about_slideshow/IMG_7251.JPG\n/about_slideshow/IMG_7252.JPG",
    "content": "The yearning from a handful of Vietnamese Buddhist Youths for a profound spiritual leader gave birth to the creation of the Vietnam Buddhist Center (VNBC), a spacious twelve-acre plus tract of land in the Southwest region of the City of Houston, Texas. In 1989, after hearing a sermon from the Venerable Thích Nguyên Hạnh, the Huyền Quang Buddhist Youth knew that they had found the spiritual leader they have wished for. They invited him to come to Houston to guide them with the practice of the Buddhist faith.\n\nCultivating the teachings of the Buddha, writing, travelling, and giving lecture are activities that the Venerable Thích Nguyên Hạnh derives most pleasure from. To him, that is total freedom. When invited by the Huyền Quang Youth, he was at the crossroad of decision. Should he continue to do what he loves most? Or should he respond to the needs of these faithful Buddhist Youths and lead a life of a monk restrained by virtually insurmountable responsibilities? He chose the latter. Giving up his enjoyment for the building and maintaining the culture of the Vietnamese at large is much more significant to him, because the vitality of the Vietnamese culture depends on the Vietnamese youth.\n\nIn 1990 he came to Houston. With the help and dedication of other monks and devoted followers, he built this Center starting with the refuge under a leaking tent to what is known today as one of Houston’s sites to be visited. He and his followers made the Vietnam Buddhist Center a place for religious observance, cultivation, and proliferation of Buddhism; a Center of Education for the Vietnamese Culture in harmony with others. The Center also serves as a retreat facility for Buddhist Sangha and lay people during the summer retreat season.\n\nAfter twelve years of continuous construction, teaching the Buddhist Dharma, maintaining the Vietnamese culture, and building the Vietnamese Buddhist Youth in Houston, the Venerable Thich Nguyen Hanh believes that the VNBC has built a strong foundation. It is time for him to divide his responsibilities among the other Sangha to free him from daily requirements, so that he may devote his time to writing and to travel to remote areas where there is no Buddhist monk to serve the Buddhist community.\n\nAt the consensus of the Sangha at the VNBC, the Venerable Thích Nguyên Hạnh remains the principal resident Buddhist Master, overseeing all the general activities of the Center. The Venerable Thích Nguyên Ðạt is responsible for the administrative function including fund raising through a multitude of activities, and the proliferation of Buddhist teachings through a weekly Vietnamese radio program, broadcasted on Wednesday from 2:30 PM to 3:00 PM, and on the first Sunday of the month from 10:00 AM to 10:45 AM at the Saigon-Houston Radio, station AM 900, Sunday English Service from 2:00 PM- 3:00 PM.\n\nThe Venerable Thích Tâm Hải is in charge of all correspondence, paper work at the VNBC, and most important of all, the bilingual website of the VNBC. In addition, the VNBC also houses two other monks who are travelling to various locations to perform religious services and give lectures; and three seminarians in training who are attending regular high school and practicing to become ordained monks. From a handful of Vietnamese Buddhist Youth, the Center now has almost 300 children who are learning the teachings of the Buddha as well as the Vietnamese Language."
}